In [6]:
#importing pandas and creating the dataframe
import pandas as pd;


data = {
    "Name":["Saad","Umair","Imran","Hashim"],
    "Roll#":[102,103,101,104],
    "Age":[21,20,22,23],
    "Address":["Kahuta","DHA","Behria","Jinnah Garden"]
}

df = pd.DataFrame(data);
print(df)

     Name  Roll#  Age        Address
0    Saad    102   21         Kahuta
1   Umair    103   20            DHA
2   Imran    101   22         Behria
3  Hashim    104   23  Jinnah Garden

In [8]:
print(df.head())
print(df.info())
print(df.describe())

     Name  Roll#  Age        Address
0    Saad    102   21         Kahuta
1   Umair    103   20            DHA
2   Imran    101   22         Behria
3  Hashim    104   23  Jinnah Garden
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Roll#    4 non-null      int64
 2   Age      4 non-null      int64
 3   Address  4 non-null      object
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes
None
            Roll#        Age
count    4.000000   4.000000
mean   102.500000  21.500000
std      1.290994   1.290994
min    101.000000  20.000000
25%    101.750000  20.750000
50%    102.500000  21.500000
75%    103.250000  22.250000
max    104.000000  23.000000

In [24]:
print(df["Address"])
print(df[["Name","Roll#"]])
print(df.loc[0:2,"Age"])
print(df.iloc[0:,1:])

   Roll#  Age        Address
0    102   21         Kahuta
1    103   20            DHA
2    101   22         Behria
3    104   23  Jinnah Garden

In [29]:
print(df[df["Age"]>21])

print(df[df["Address"] == "Behria"])

     Name  Roll#  Age        Address
2   Imran    101   22         Behria
3  Hashim    104   23  Jinnah Garden
    Name  Roll#  Age Address
2  Imran    101   22  Behria

In [31]:
df["CGPA"]=[3.11,3.21,3.31,3.15]
df = df.drop("Roll#",axis=1)
print(df)

     Name  Age        Address  CGPA
0    Saad   21         Kahuta  3.11
1   Umair   20            DHA  3.21
2   Imran   22         Behria  3.31
3  Hashim   23  Jinnah Garden  3.15

In [35]:
print(df.sort_values(by="CGPA",ascending=False))

     Name  Age        Address  CGPA
2   Imran   22         Behria  3.31
1   Umair   20            DHA  3.21
3  Hashim   23  Jinnah Garden  3.15
0    Saad   21         Kahuta  3.11

In [39]:
df.loc[4]=["Hassan",23,"G-11",3.25]
print(df)
df = df.drop(0)
df=df.reset_index(drop=True)
print(df);

     Name  Age        Address  CGPA
1   Umair   20            DHA  3.21
2   Imran   22         Behria  3.31
3  Hashim   23  Jinnah Garden  3.15
4  Hassan   23           G-11  3.25
     Name  Age        Address  CGPA
0   Umair   20            DHA  3.21
1   Imran   22         Behria  3.31
2  Hashim   23  Jinnah Garden  3.15
3  Hassan   23           G-11  3.25

In [42]:
newRow=pd.DataFrame({
    "Name":["Saad"],
    "Age":[21],
    "Address":["Kahuta"],
    "CGPA":[3.40]
})
df = df.drop(0);
df = pd.concat([df,newRow],ignore_index=True)
print(df)

     Name  Age        Address  CGPA
0   Imran   22         Behria  3.31
1  Hashim   23  Jinnah Garden  3.15
2  Hassan   23           G-11  3.25
3    Saad   21         Kahuta  3.40

In [44]:
print(df.isnull())
print(df.isnull().sum())

    Name    Age  Address   CGPA
0  False  False    False  False
1  False  False    False  False
2  False  False    False  False
3  False  False    False  False
Name       0
Age        0
Address    0
CGPA       0
dtype: int64

In [46]:
import numpy as np
df.loc[4]=["",np.nan,"",np.nan]
print(df)

     Name   Age        Address  CGPA
0   Imran  22.0         Behria  3.31
1  Hashim  23.0  Jinnah Garden  3.15
2  Hassan  23.0           G-11  3.25
3    Saad  21.0         Kahuta  3.40
4           NaN                  NaN

In [48]:
print(df.isnull().sum())

Name       0
Age        1
Address    0
CGPA       1
dtype: int64

In [50]:
df["CGPA"].fillna(df["CGPA"].mean())
print(df)

     Name   Age        Address    CGPA
0   Imran  22.0         Behria  3.3100
1  Hashim  23.0  Jinnah Garden  3.1500
2  Hassan  23.0           G-11  3.2500
3    Saad  21.0         Kahuta  3.4000
4           NaN                 3.2775

In [52]:
df["Age"].fillna(method="ffill",inplace=True)
print(df)

     Name   Age        Address    CGPA
0   Imran  22.0         Behria  3.3100
1  Hashim  23.0  Jinnah Garden  3.1500
2  Hassan  23.0           G-11  3.2500
3    Saad  21.0         Kahuta  3.4000
4          21.0                 3.2775

/tmp/ipython-input-1306603361.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method="ffill",inplace=True)

In [53]:
df.loc[5] = [np.nan,22,np.nan,3.22]
print(df)

     Name   Age        Address    CGPA
0   Imran  22.0         Behria  3.3100
1  Hashim  23.0  Jinnah Garden  3.1500
2  Hassan  23.0           G-11  3.2500
3    Saad  21.0         Kahuta  3.4000
4          21.0                 3.2775
5     NaN  22.0            NaN  3.2200

In [54]:
df["Name"].fillna("Unknown",inplace=True)
print(df)

      Name   Age        Address    CGPA
0    Imran  22.0         Behria  3.3100
1   Hashim  23.0  Jinnah Garden  3.1500
2   Hassan  23.0           G-11  3.2500
3     Saad  21.0         Kahuta  3.4000
4           21.0                 3.2775
5  Unknown  22.0            NaN  3.2200

/tmp/ipython-input-2355779977.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Name"].fillna("Unknown",inplace=True)

In [55]:
df["Address"] = df["Address"].fillna("Unknown")
print(df)

      Name   Age        Address    CGPA
0    Imran  22.0         Behria  3.3100
1   Hashim  23.0  Jinnah Garden  3.1500
2   Hassan  23.0           G-11  3.2500
3     Saad  21.0         Kahuta  3.4000
4           21.0                 3.2775
5  Unknown  22.0        Unknown  3.2200